----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\s.KIshida\Dropbox (OCDE)\RMLP\Data Files\SY 2018-19\RMLP Do Files 1819\kishida\LogFiles\StudentFallTTestResults.log
  log type:  text
 opened on:   1 Aug 2019, 15:20:45

. 
. *sample size
. tab survey,m

     survey |      Freq.     Percent        Cum.
------------+-----------------------------------
          A |        468       60.78       60.78
          B |        139       18.05       78.83
         BE |         88       11.43       90.26
          D |         75        9.74      100.00
------------+-----------------------------------
      Total |        770      100.00

. 
. *demographics
. 
. tab gender if survey=="A", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |        216       46.15       46.15
Decline to State |          4        0.85       47.01
            Girl |        248       52.99      100.00
-----------------+-----------------------------------
           Total |        468      100.00

. tab gender if survey=="B", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |         62       44.60       44.60
Decline to State |          3        2.16       46.76
            Girl |         74       53.24      100.00
-----------------+-----------------------------------
           Total |        139      100.00

. tab gender if survey=="BE", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |         47       53.41       53.41
            Girl |         41       46.59      100.00
-----------------+-----------------------------------
           Total |         88      100.00

. tab gender if survey=="C", m
no observations

. tab gender if survey=="D", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |         41       54.67       54.67
Decline to State |          1        1.33       56.00
            Girl |         33       44.00      100.00
-----------------+-----------------------------------
           Total |         75      100.00

. 
. tab gender grade if survey=="A", col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |                    grade
          gender |         9         10         11         12 |     Total
-----------------+--------------------------------------------+----------
             Boy |        34         79         65         38 |       216 
                 |     45.33      43.89      47.45      50.00 |     46.15 
-----------------+--------------------------------------------+----------
Decline to State |         0          1          1          2 |         4 
                 |      0.00       0.56       0.73       2.63 |      0.85 
-----------------+--------------------------------------------+----------
            Girl |        41        100         71         36 |       248 
                 |     54.67      55.56      51.82      47.37 |     52.99 
-----------------+--------------------------------------------+----------
           Total |        75        180        137         76 |       468 
                 |    100.00     100.00     100.00     100.00 |    100.00 

. tab gender grade if survey=="B", col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |         grade
          gender |         7          8 |     Total
-----------------+----------------------+----------
             Boy |        35         27 |        62 
                 |     49.30      39.71 |     44.60 
-----------------+----------------------+----------
Decline to State |         2          1 |         3 
                 |      2.82       1.47 |      2.16 
-----------------+----------------------+----------
            Girl |        34         40 |        74 
                 |     47.89      58.82 |     53.24 
-----------------+----------------------+----------
           Total |        71         68 |       139 
                 |    100.00     100.00 |    100.00 

. 
. tab age if survey=="A", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |        239       51.07       51.07
16-17 years |        217       46.37       97.44
18-25 years |         12        2.56      100.00
------------+-----------------------------------
      Total |        468      100.00

. tab age if survey=="B", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |        137       98.56       98.56
 6-10 years |          2        1.44      100.00
------------+-----------------------------------
      Total |        139      100.00

. tab age if survey=="BE", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |         88      100.00      100.00
------------+-----------------------------------
      Total |         88      100.00

. tab age if survey=="C", m
no observations

. tab age if survey=="D", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |          1        1.33        1.33
 6-10 years |         74       98.67      100.00
------------+-----------------------------------
      Total |         75      100.00

. 
. 
. ttest pss_post==pss_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pss_post |     468    19.26496    .3120295    6.750231     18.6518    19.87811
 pss_pre |     468    20.99359    .3202919    6.928973     20.3642    21.62298
---------+--------------------------------------------------------------------
    diff |     468   -1.728632    .2825356     6.11218   -2.283831   -1.173434
------------------------------------------------------------------------------
     mean(diff) = mean(pss_post - pss_pre)                        t =  -6.1183
 Ho: mean(diff) = 0                              degrees of freedom =      467

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest asri_post==asri_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
asri_p~t |     468     2.19486    .0179179    .3876226     2.15965     2.23007
asri_pre |     468    2.162512    .0184889    .3999761     2.12618    2.198844
---------+--------------------------------------------------------------------
    diff |     468    .0323481    .0130232    .2817358    .0067566    .0579395
------------------------------------------------------------------------------
     mean(diff) = mean(asri_post - asri_pre)                      t =   2.4839
 Ho: mean(diff) = 0                              degrees of freedom =      467

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9933         Pr(|T| > |t|) = 0.0133          Pr(T > t) = 0.0067

. ttest pgh_post==pgh_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |     468    23.56197    .2402513     5.19743    23.08986    24.03407
 pgh_pre |     468    23.38248    .2355521    5.095772    22.91961    23.84535
---------+--------------------------------------------------------------------
    diff |     468    .1794872    .1687934    3.651559   -.1522014    .5111757
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   1.0634
 Ho: mean(diff) = 0                              degrees of freedom =      467

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8559         Pr(|T| > |t|) = 0.2882          Pr(T > t) = 0.1441

. 
. ttest sam_post==sam_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam_post |     139    1.275997    .0576008     .679104    1.162103    1.389892
 sam_pre |     139    1.383911    .0548706    .6469145    1.275415    1.492407
---------+--------------------------------------------------------------------
    diff |     139   -.1079137    .0505254    .5956854   -.2078177   -.0080097
------------------------------------------------------------------------------
     mean(diff) = mean(sam_post - sam_pre)                        t =  -2.1358
 Ho: mean(diff) = 0                              degrees of freedom =      138

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0172         Pr(|T| > |t|) = 0.0345          Pr(T > t) = 0.9828

. ttest srq_post==srq_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
srq_post |     139    2.688987    .0439428    .5180782    2.602099    2.775876
 srq_pre |     139    2.797454    .0374159    .4411265    2.723472    2.871437
---------+--------------------------------------------------------------------
    diff |     139   -.1084671    .0321734    .3793184   -.1720836   -.0448506
------------------------------------------------------------------------------
     mean(diff) = mean(srq_post - srq_pre)                        t =  -3.3713
 Ho: mean(diff) = 0                              degrees of freedom =      138

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0005         Pr(|T| > |t|) = 0.0010          Pr(T > t) = 0.9995

. ttest pgh_post==pgh_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |     139    22.92806    .4372453    5.155046    22.06349    23.79262
 pgh_pre |     139    23.57554    .3904258    4.603053    22.80355    24.34753
---------+--------------------------------------------------------------------
    diff |     139    -.647482    .3421618    4.034028    -1.32404    .0290757
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =  -1.8923
 Ho: mean(diff) = 0                              degrees of freedom =      138

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0303         Pr(|T| > |t|) = 0.0605          Pr(T > t) = 0.9697

. 
. ttest sam_post==sam_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam_post |      88     1.81405     .075723    .7103449    1.663542    1.964557
 sam_pre |      88    1.636364    .0582013    .5459768    1.520682    1.752045
---------+--------------------------------------------------------------------
    diff |      88     .177686    .0618503    .5802076    .0547517    .3006202
------------------------------------------------------------------------------
     mean(diff) = mean(sam_post - sam_pre)                        t =   2.8728
 Ho: mean(diff) = 0                              degrees of freedom =       87

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9974         Pr(|T| > |t|) = 0.0051          Pr(T > t) = 0.0026

. ttest srq_post==srq_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
srq_post |      88    2.935315    .0518449    .4863486    2.832267    3.038362
 srq_pre |      88    2.894231    .0477381    .4478234    2.799346    2.989115
---------+--------------------------------------------------------------------
    diff |      88    .0410839    .0336824    .3159693   -.0258636    .1080314
------------------------------------------------------------------------------
     mean(diff) = mean(srq_post - srq_pre)                        t =   1.2197
 Ho: mean(diff) = 0                              degrees of freedom =       87

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8871         Pr(|T| > |t|) = 0.2259          Pr(T > t) = 0.1129

. ttest pgh_post==pgh_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |      88    27.28409    .4756201    4.461712    26.33874    28.22944
 pgh_pre |      88    26.59091    .4627268    4.340762    25.67119    27.51063
---------+--------------------------------------------------------------------
    diff |      88    .6931818    .3221848    3.022361    .0528047    1.333559
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   2.1515
 Ho: mean(diff) = 0                              degrees of freedom =       87

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9829         Pr(|T| > |t|) = 0.0342          Pr(T > t) = 0.0171

. 
. *ttest psq_post==psq_pre if survey=="C"
. *ttest srq_post==srq_pre if survey=="C"
. *ttest pgh_post==pgh_pre if survey=="C"
. 
. ttest psq_post==psq_pre if survey=="D"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
psq_post |      75    37.09333    1.106439     9.58204    34.88871    39.29796
 psq_pre |      75    38.02667    1.169272    10.12619    35.69684    40.35649
---------+--------------------------------------------------------------------
    diff |      75   -.9333333    .9605429    8.318545   -2.847257    .9805902
------------------------------------------------------------------------------
     mean(diff) = mean(psq_post - psq_pre)                        t =  -0.9717
 Ho: mean(diff) = 0                              degrees of freedom =       74

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1672         Pr(|T| > |t|) = 0.3344          Pr(T > t) = 0.8328

. ttest pgh_post==pgh_pre if survey=="D"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |      75    27.49333    .4955199    4.291328    26.50599    28.48068
 pgh_pre |      75        27.4    .3990981    3.456291    26.60478    28.19522
---------+--------------------------------------------------------------------
    diff |      75    .0933333    .4757823    4.120395   -.8546835     1.04135
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   0.1962
 Ho: mean(diff) = 0                              degrees of freedom =       74

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5775         Pr(|T| > |t|) = 0.8450          Pr(T > t) = 0.4225

. 
. log close
      name:  <unnamed>
       log:  C:\Users\s.KIshida\Dropbox (OCDE)\RMLP\Data Files\SY 2018-19\RMLP Do Files 1819\kishida\LogFiles\StudentFallTTestResults.log
  log type:  text
 closed on:   1 Aug 2019, 15:20:45
----------------------------------------------------------------------------------------------------------------------------------------------------------
