----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\s.KIshida\Dropbox (OCDE)\RMLP\Data Files\SY 2018-19\RMLP Do Files 1819\kishida\LogFiles\StudentSpringTTestResults.log
  log type:  text
 opened on:   1 Aug 2019, 15:21:22

. 
. *sample size
. tab survey,m

     survey |      Freq.     Percent        Cum.
------------+-----------------------------------
          A |        368       59.07       59.07
          B |        179       28.73       87.80
         BE |          7        1.12       88.92
          C |         19        3.05       91.97
          D |         50        8.03      100.00
------------+-----------------------------------
      Total |        623      100.00

. 
. * *demographics
. tab gender if survey=="A", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |        156       42.39       42.39
Decline to State |          6        1.63       44.02
            Girl |        206       55.98      100.00
-----------------+-----------------------------------
           Total |        368      100.00

. tab gender if survey=="B", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |         70       39.11       39.11
Decline to State |          4        2.23       41.34
            Girl |        105       58.66      100.00
-----------------+-----------------------------------
           Total |        179      100.00

. tab gender if survey=="BE", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |          2       28.57       28.57
            Girl |          5       71.43      100.00
-----------------+-----------------------------------
           Total |          7      100.00

. tab gender if survey=="C", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |          8       42.11       42.11
            Girl |         11       57.89      100.00
-----------------+-----------------------------------
           Total |         19      100.00

. tab gender if survey=="D", m

          gender |      Freq.     Percent        Cum.
-----------------+-----------------------------------
             Boy |         25       50.00       50.00
Decline to State |          2        4.00       54.00
            Girl |         23       46.00      100.00
-----------------+-----------------------------------
           Total |         50      100.00

. 
. tab gender grade if survey=="A", col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |                    grade
          gender |         9         10         11         12 |     Total
-----------------+--------------------------------------------+----------
             Boy |       109         19         21          7 |       156 
                 |     46.19      32.76      39.62      33.33 |     42.39 
-----------------+--------------------------------------------+----------
Decline to State |         4          0          2          0 |         6 
                 |      1.69       0.00       3.77       0.00 |      1.63 
-----------------+--------------------------------------------+----------
            Girl |       123         39         30         14 |       206 
                 |     52.12      67.24      56.60      66.67 |     55.98 
-----------------+--------------------------------------------+----------
           Total |       236         58         53         21 |       368 
                 |    100.00     100.00     100.00     100.00 |    100.00 

. tab gender grade if survey=="B", col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |              grade
          gender |         6          7          8 |     Total
-----------------+---------------------------------+----------
             Boy |         0         35         35 |        70 
                 |      0.00      43.75      35.71 |     39.11 
-----------------+---------------------------------+----------
Decline to State |         0          2          2 |         4 
                 |      0.00       2.50       2.04 |      2.23 
-----------------+---------------------------------+----------
            Girl |         1         43         61 |       105 
                 |    100.00      53.75      62.24 |     58.66 
-----------------+---------------------------------+----------
           Total |         1         80         98 |       179 
                 |    100.00     100.00     100.00 |    100.00 

. 
. tab age if survey=="A", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |        270       73.37       73.37
16-17 years |         85       23.10       96.47
18-25 years |         13        3.53      100.00
------------+-----------------------------------
      Total |        368      100.00

. tab age if survey=="B", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |        179      100.00      100.00
------------+-----------------------------------
      Total |        179      100.00

. tab age if survey=="BE", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |          7      100.00      100.00
------------+-----------------------------------
      Total |          7      100.00

. tab age if survey=="C", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |          7       36.84       36.84
 6-10 years |         12       63.16      100.00
------------+-----------------------------------
      Total |         19      100.00

. tab age if survey=="D", m

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
11-15 years |          1        2.00        2.00
 6-10 years |         49       98.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. 
. 
. ttest pss_post==pss_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pss_post |     368    19.79348    .3464485    6.646034    19.11221    20.47475
 pss_pre |     368    20.17391    .3400479    6.523249    19.50523     20.8426
---------+--------------------------------------------------------------------
    diff |     368   -.3804348    .2991312    5.738331    -.968661    .2077914
------------------------------------------------------------------------------
     mean(diff) = mean(pss_post - pss_pre)                        t =  -1.2718
 Ho: mean(diff) = 0                              degrees of freedom =      367

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1021         Pr(|T| > |t|) = 0.2042          Pr(T > t) = 0.8979

. ttest asri_post==asri_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
asri_p~t |     368    2.153155    .0197879    .3795978    2.114243    2.192067
asri_pre |     368    2.172328    .0195275    .3746016    2.133928    2.210728
---------+--------------------------------------------------------------------
    diff |     368   -.0191727    .0155046    .2974303   -.0496618    .0113164
------------------------------------------------------------------------------
     mean(diff) = mean(asri_post - asri_pre)                      t =  -1.2366
 Ho: mean(diff) = 0                              degrees of freedom =      367

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1085         Pr(|T| > |t|) = 0.2170          Pr(T > t) = 0.8915

. ttest pgh_post==pgh_pre if survey=="A"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |     368    23.46196    .2671866    5.125527    22.93655    23.98737
 pgh_pre |     368    23.25815    .2728493    5.234156    22.72161     23.7947
---------+--------------------------------------------------------------------
    diff |     368    .2038043      .18334    3.517072   -.1567245    .5643332
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   1.1116
 Ho: mean(diff) = 0                              degrees of freedom =      367

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8665         Pr(|T| > |t|) = 0.2670          Pr(T > t) = 0.1335

. 
. ttest sam_post==sam_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam_post |     179     1.37227     .051106    .6837523    1.271418    1.473122
 sam_pre |     179    1.397156    .0527009    .7050902    1.293157    1.501155
---------+--------------------------------------------------------------------
    diff |     179   -.0248857    .0394289    .5275222   -.1026939    .0529224
------------------------------------------------------------------------------
     mean(diff) = mean(sam_post - sam_pre)                        t =  -0.6312
 Ho: mean(diff) = 0                              degrees of freedom =      178

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.2644         Pr(|T| > |t|) = 0.5287          Pr(T > t) = 0.7356

. ttest srq_post==srq_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
srq_post |     179    2.773098    .0355536    .4756747    2.702938    2.843259
 srq_pre |     179    2.826816    .0365558    .4890832    2.754677    2.898954
---------+--------------------------------------------------------------------
    diff |     179   -.0537172    .0278874    .3731083   -.1087498    .0013153
------------------------------------------------------------------------------
     mean(diff) = mean(srq_post - srq_pre)                        t =  -1.9262
 Ho: mean(diff) = 0                              degrees of freedom =      178

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0278         Pr(|T| > |t|) = 0.0557          Pr(T > t) = 0.9722

. ttest pgh_post==pgh_pre if survey=="B"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |     179    24.32961    .3964389    5.303991    23.54728    25.11193
 pgh_pre |     179    24.75978    .3813109    5.101592     24.0073    25.51225
---------+--------------------------------------------------------------------
    diff |     179   -.4301676    .2813361     3.76402   -.9853509    .1250157
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =  -1.5290
 Ho: mean(diff) = 0                              degrees of freedom =      178

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0640         Pr(|T| > |t|) = 0.1280          Pr(T > t) = 0.9360

. 
. ttest sam_post==sam_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam_post |       7    1.883117    .2993593    .7920304    1.150611    2.615623
 sam_pre |       7    1.766234    .2783385    .7364144    1.085164    2.447304
---------+--------------------------------------------------------------------
    diff |       7    .1168831    .1679966    .4444772   -.2941898     .527956
------------------------------------------------------------------------------
     mean(diff) = mean(sam_post - sam_pre)                        t =   0.6957
 Ho: mean(diff) = 0                              degrees of freedom =        6

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.7437         Pr(|T| > |t|) = 0.5126          Pr(T > t) = 0.2563

. ttest srq_post==srq_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
srq_post |       7    3.098901     .206757    .5470276    2.592985    3.604817
 srq_pre |       7    3.120879    .1276808    .3378115    2.808456    3.433303
---------+--------------------------------------------------------------------
    diff |       7    -.021978    .1498701    .3965191   -.3886971     .344741
------------------------------------------------------------------------------
     mean(diff) = mean(srq_post - srq_pre)                        t =  -0.1466
 Ho: mean(diff) = 0                              degrees of freedom =        6

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.4441         Pr(|T| > |t|) = 0.8882          Pr(T > t) = 0.5559

. ttest pgh_post==pgh_pre if survey=="BE"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |       7    27.57143    2.496256    6.604472    21.46331    33.67955
 pgh_pre |       7    27.57143    2.010178    5.318432     22.6527    32.49016
---------+--------------------------------------------------------------------
    diff |       7           0    .7559289           2   -1.849691    1.849691
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   0.0000
 Ho: mean(diff) = 0                              degrees of freedom =        6

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5000         Pr(|T| > |t|) = 1.0000          Pr(T > t) = 0.5000

. 
. ttest psq_post==psq_pre if survey=="C"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
psq_post |      19    37.68421    2.568423     11.1955    32.28815    43.08027
 psq_pre |      19    38.57895    2.803836    12.22164    32.68831    44.46959
---------+--------------------------------------------------------------------
    diff |      19   -.8947368    1.440628     6.27955   -3.921383    2.131909
------------------------------------------------------------------------------
     mean(diff) = mean(psq_post - psq_pre)                        t =  -0.6211
 Ho: mean(diff) = 0                              degrees of freedom =       18

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.2712         Pr(|T| > |t|) = 0.5423          Pr(T > t) = 0.7288

. ttest srq_post==srq_pre if survey=="C"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
srq_post |      19    2.874494    .1096112    .4777842    2.644209    3.104779
 srq_pre |      19    2.785425    .1237525    .5394246    2.525431     3.04542
---------+--------------------------------------------------------------------
    diff |      19    .0890688    .0811402    .3536818   -.0814004     .259538
------------------------------------------------------------------------------
     mean(diff) = mean(srq_post - srq_pre)                        t =   1.0977
 Ho: mean(diff) = 0                              degrees of freedom =       18

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8566         Pr(|T| > |t|) = 0.2868          Pr(T > t) = 0.1434

. ttest pgh_post==pgh_pre if survey=="C"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |      19    28.15789    1.152833    5.025083    25.73588    30.57991
 pgh_pre |      19    27.73684    1.196589     5.21581     25.2229    30.25078
---------+--------------------------------------------------------------------
    diff |      19    .4210526    .7465938    3.254327   -1.147483    1.989588
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   0.5640
 Ho: mean(diff) = 0                              degrees of freedom =       18

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.7101         Pr(|T| > |t|) = 0.5797          Pr(T > t) = 0.2899

. 
. ttest psq_post==psq_pre if survey=="D"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
psq_post |      50       35.92    1.450078     10.2536    33.00596    38.83404
 psq_pre |      50       38.18    1.485629    10.50498    35.19452    41.16548
---------+--------------------------------------------------------------------
    diff |      50       -2.26    .9892524    6.995071   -4.247977   -.2720228
------------------------------------------------------------------------------
     mean(diff) = mean(psq_post - psq_pre)                        t =  -2.2846
 Ho: mean(diff) = 0                              degrees of freedom =       49

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0134         Pr(|T| > |t|) = 0.0267          Pr(T > t) = 0.9866

. ttest pgh_post==pgh_pre if survey=="D"

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
pgh_post |      50       27.64    .6920894    4.893811    26.24919    29.03081
 pgh_pre |      50       26.98    .6574471    4.648853    25.65881    28.30119
---------+--------------------------------------------------------------------
    diff |      50         .66     .562509    3.977539   -.4704041    1.790404
------------------------------------------------------------------------------
     mean(diff) = mean(pgh_post - pgh_pre)                        t =   1.1733
 Ho: mean(diff) = 0                              degrees of freedom =       49

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8768         Pr(|T| > |t|) = 0.2463          Pr(T > t) = 0.1232

. 
. log close
      name:  <unnamed>
       log:  C:\Users\s.KIshida\Dropbox (OCDE)\RMLP\Data Files\SY 2018-19\RMLP Do Files 1819\kishida\LogFiles\StudentSpringTTestResults.log
  log type:  text
 closed on:   1 Aug 2019, 15:21:22
----------------------------------------------------------------------------------------------------------------------------------------------------------
